#+title: Editor Basics

Configuration for editor basics.

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** markdown

#+begin_src emacs-lisp
(use-package markdown-mode
  :straight t
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
	 ("\\.mdx\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode)
	 )
  :commands (markdown-mode gfm-mode)
  :hook ((markdown-mode . markdown-toggle-inline-images)
	 (markdown-mode . variable-pitch-mode)
	 (markdown-mode . visual-line-mode))
  :custom
  (markdown-list-item-bullets '("●" "○" "•"))
  (markdown-hide-markup nil)
  (markdown-footnote-location 'header)
  (markdown-max-image-size '(400 . 400))
  (markdown-indent-on-enter 'indent-and-new-item)
  (markdown-hide-urls t)
  (markdown-hide-markup t)
  (markdown-header-scaling t)
  (markdown-list-indent-width 2)
  ;; (markdown-nested-imenu-heading-index nil)
  (markdown-command "multimarkdown")
  (markdown-coding-system 'utf-8)
  (markdown-enable-math t)
  (markdown-enable-wiki-links t)
  (markdown-asymmetric-header t)
  (markdown-italic-underscore t)
  (markdown-fontify-code-blocks-natively t)
  (markdown-fontify-code-block-default-mode t)
  (markdown-make-gfm-checkboxes-buttons t)
  (markdown-gfm-uppercase-checkbox t)
  (markdown-gfm-additional-languages '("Mermaid" "plantuml" "sh" "Go" "Java" "Python"))
  (markdown-content-type "application/xhtml+xml")
  (markdown-xhtml-header-content "\n<meta name=\"viewport\" content=\"width=device-width\">")
  (markdown-split-window-direction 'right)
  :config
    ;; https://github.com/cadadr/emacs.d
    (defun gk-markdown-preview-buffer ()
      (interactive)
      (require 'shr)
      (let* ((buf-this (buffer-name (current-buffer)))
             (buf-html (get-buffer-create
                        (format "*md-html (%s)*" buf-this))))
        (markdown-other-window (buffer-name buf-html))
        (shr-render-buffer buf-html)
        (eww-mode)
        (kill-buffer buf-html)))
  ;; HACK Due to jrblevin/markdown-mode#578, invoking `imenu' throws a
  ;;      'wrong-type-argument consp nil' error if you use native-comp.
  (setq markdown-nested-imenu-heading-index (not (ignore-errors (native-comp-available-p))))
  ;; A sensible and simple default preamble for markdown exports that
  ;; takes after the github asthetic (plus highlightjs syntax coloring).
  (setq markdown-css-paths '("https://cdn.jsdelivr.net/npm/github-markdown-css/github-markdown.min.css"
                             "https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/styles/github.min.css"))
  (setq markdown-xhtml-header-content "
<meta name='viewport' content='width=device-width, initial-scale=1, shrink-to-fit=no'>
<style>
.markdown-body {
  box-sizing: border-box;
  max-width: 980px;
  min-width: 200px;
  width: 100%;
  margin: 0 auto;
  padding: 45px;
  // margin: 40px auto;
  // padding: 0 10px;
}

@media (max-width: 767px) {
 .markdown-body {
    padding: 15px;
 }
}
</style>
<link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/styles/default.min.css'>
<script src='https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/highlight.min.js'></script>
<script>
document.addEventListener('DOMContentLoaded', () => {
  document.body.classList.add('markdown-body');
  document.querySelectorAll('pre code').forEach((code) => {
    if (code.className != 'mermaid') {
      hljs.highlightBlock(code);
    }
  });
});
</script>
<script src='https://cdn.jsdelivr.net/npm/mermaid/dist/mermaid.min.js'></script>
<script>
mermaid.initialize({
  theme: 'default',  // default, forest, dark, neutral
  startOnLoad: true
});
</script>
")
  ;; (setq markdown-xhtml-header-content "
  ;; <meta name='viewport' content='width=device-width, initial-scale=1, shrink-to-fit=no'>
  ;; <style>
  ;; body {
  ;;   box-sizing: border-box;
  ;;   max-width: 740px;
  ;;   width: 100%;
  ;;   margin: 40px auto;
  ;;   padding: 0 10px;
  ;; }
  ;; </style>
  ;; <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/styles/default.min.css'>
  ;; <script src='https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/highlight.min.js'></script>
  ;; <script>
  ;; document.addEventListener('DOMContentLoaded', () => {
  ;;   document.body.classList.add('markdown-body');
  ;;   document.querySelectorAll('pre code').forEach((code) => {
  ;;     if (code.className != 'mermaid') {
  ;;       hljs.highlightBlock(code);
  ;;     }
  ;;   });
  ;; });
  ;; </script>
  ;; <script src='https://unpkg.com/mermaid@8.4.8/dist/mermaid.min.js'></script>
  ;; <script>
  ;; mermaid.initialize({
  ;;   theme: 'default',  // default, forest, dark, neutral
  ;;   startOnLoad: true
  ;; });
  ;; </script>
  ;; ")
  )

(use-package markdown-toc
  :straight t
  :commands (markdown-toc-generate-toc markdown-toc-generate-or-refresh-toc)
  :hook ((markdown-mode . markdown-toc-mode))
  :custom
  (markdown-toc-header-toc-start "<!-- markdown-toc start -->")
  (markdown-toc-indentation-space 2)
  (markdown-toc-header-toc-title "\n**Table of Contents**")
  :config
  ;; ISSUE https://github.com/ardumont/markdown-toc/issues/47
  (defun markdown-toc-refresh-before-save ()
    "Refresh markdown TOC before save."
    (when (and (derived-mode-p 'markdown-mode)
               (require 'markdown-toc)
               (markdown-toc--toc-already-present-p))
      (markdown-toc-generate-toc t)))
  (add-hook 'before-save-hook #'markdown-toc-refresh-before-save))

(use-package edit-indirect
  :straight t)

(use-package grip-mode
  :straight t
  :bind (:map markdown-mode-command-map
              ("g" . grip-mode)))

(use-package mmm-mode
  :straight t
  :hook (markdown-mode . mmm-mode))

(use-package pandoc-mode
  :ensure-system-package pandoc
  :defer t
  :hook ((markdown-mode . pandoc-mode)
         (pandoc-mode . pandoc-load-default-settings)))
#+end_src

#+RESULTS:
| pandoc-load-default-settings |

